mascotte-g2/cases/agile-80mm/0/CO2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      CO2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    geom
    {
        type            zeroGradient;
    }
    slipwalls
    {
        type            zeroGradient;
    }
    noslipwalls
    {
        type            zeroGradient;
    }
    ch4inlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    loxinlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    axisymmetric
    {
        type            symmetry;
    }
    outlet
    {
        type            zeroGradient;
    }
    planeMinus
    {
        type            wedge;
    }
    planePlus
    {
        type            wedge;
    }
}


// ************************************************************************* //
