mascotte-g2/cases/agile-80mm/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    geom
    {
        type            noSlip;
    }
    slipwalls
    {
        type            slip;
    }
    noslipwalls
    {
        type            noSlip;
    }
    ch4inlet
    {
        type            flowRateInletVelocity;
        massFlowRate    table;
        massFlowRateCoeffs
        {
            values
3
(
(0 0)
(5e-05 0.0019875)
(1 0.0019875)
)
;
        }
        rhoInlet        42.9947;
        extrapolateProfile 0;
        value           uniform (0 0 0);
    }
    loxinlet
    {
        type            flowRateInletVelocity;
        massFlowRate    table;
        massFlowRateCoeffs
        {
            values
3
(
(0 0)
(5e-05 0.0006166666666666669)
(1 0.0006166666666666669)
)
;
        }
        rhoInlet        1328.24;
        extrapolateProfile 0;
        value           uniform (0 0 0);
    }
    axisymmetric
    {
        type            symmetry;
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    planeMinus
    {
        type            wedge;
    }
    planePlus
    {
        type            wedge;
    }
}


// ************************************************************************* //
