mascotte-g2/cases/agile-80mm/0/include/scalarWallsWedges
geom
{
    type zeroGradient;
}
slipwalls
{
    type zeroGradient;
}
noslipwalls
{
    type zeroGradient;
}
axisymmetric
{
    type symmetry;
}
planeMinus
{
    type wedge;
}
planePlus
{
    type wedge;
}
