mascotte-g2/cases/agile-80mm/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    geom
    {
        type            nutkWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.800000000000001;
        value           uniform 0;
    }
    slipwalls
    {
        type            calculated;
        value           uniform 0;
    }
    noslipwalls
    {
        type            nutkWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.800000000000001;
        value           uniform 0;
    }
    ch4inlet
    {
        type            calculated;
        value           uniform 0;
    }
    loxinlet
    {
        type            calculated;
        value           uniform 0;
    }
    axisymmetric
    {
        type            symmetry;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    planeMinus
    {
        type            wedge;
    }
    planePlus
    {
        type            wedge;
    }
}


// ************************************************************************* //
