mascotte-g2/cases/agile-80mm/constant/momentumTransport
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      momentumTransport;
}

simulationType RAS;

RAS
{
    model           kEpsilon;
    turbulence      on;
    printCoeffs     on;

    kEpsilonCoeffs
    {
        // Match the Fluent reference case.
        C1          1.4;
    }
}
