mascotte-g2/cases/agile-80mm/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

9
(
    geom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          407;
        startFace       212707;
    }
    slipwalls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          129;
        startFace       213114;
    }
    noslipwalls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          382;
        startFace       213243;
    }
    ch4inlet
    {
        type            patch;
        nFaces          54;
        startFace       213625;
    }
    loxinlet
    {
        type            patch;
        nFaces          49;
        startFace       213679;
    }
    axisymmetric
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          0;
        startFace       213728;
    }
    outlet
    {
        type            patch;
        nFaces          276;
        startFace       213728;
    }
    planeMinus
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          106782;
        startFace       214004;
    }
    planePlus
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          106782;
        startFace       320786;
    }
)

// ************************************************************************* //
