mascotte-g2/cases/agile-80mm/constant/thermophysicalTransport
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalTransport;
}

RAS
{
    model       eddyDiffusivity;
    Prt         0.85;
}
