mascotte-g2/cases/agile-80mm/system/fvSchemes
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         cellLimited Gauss linear 1;
}

divSchemes
{
    default                                     none;
    div(phi,U)                                  Gauss upwind;
    div(phi,Yi)                                 Gauss upwind;
    div(phi,Yi_h)                               Gauss upwind;
    div(phi,h)                                  Gauss upwind;
    div(phi,K)                                  Gauss limitedLinear 1;
    div(phid,p)                                 Gauss limitedLinear 1;
    div(phi,k)                                  Gauss upwind;
    div(phi,epsilon)                            Gauss upwind;
    div(((rho*nuEff)*dev2(T(grad(U)))))         Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method          meshWave;
}

fluxRequired
{
    default         no;
    p;
}
