mascotte-g2/cases/agile-80mm/system/topoSetDict
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object topoSetDict;
}

actions
(
    {
        name keepCells;
        type cellSet;
        action new;
        source boxToCell;
        sourceInfo
        {
            box (-1 -1 -1) (0.080000001 1 1);
        }
    }
);

